Revit 2024 API
DrawContext.GetOverrideColor Method
 Returns override color that will be applied to geometry during rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static bool GetOverrideColor(
	out Color color
)
Visual Basic
Public Shared Function GetOverrideColor ( _
	<OutAttribute> ByRef color As Color _
) As Boolean
Visual C++
public:
static bool GetOverrideColor(
	[OutAttribute] Color^% color
)
Parameters
color
Type: Autodesk.Revit.DB.Color
See Also
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace